In [2]:
name = c('Alex', 'Lilly', 'Mark', 'Oliver', 'Martha', 'Lucas', 'Caroline')
Age = c(25, 31, 23, 52, 76, 49, 26)
Height = c(177, 163, 190, 179, 163, 183, 164)
Weight = c(57, 69, 83, 75, 70, 83, 53)
Sex = factor(c('F', 'F', 'M', 'M', 'F', 'M', 'F'))

In [3]:
df = data.frame(row.names = name, Age, Height, Weight, Sex)
df

         Age Height Weight Sex
Alex     25  177    57     F
Lilly    31  163    69     F
Mark     23  190    83     M
Oliver   52  179    75     M
Martha   76  163    70     F
Lucas    49  183    83     M
Caroline 26  164    53     F

In [5]:
print(levels(df$Sex))

[1] "F" "M"

In [6]:
working = factor(c('Yes', 'No','No','Yes','Yes','No','Yes'))
df2 = data.frame(row.names = name, working)
df2

         working
Alex     Yes
Lilly    No
Mark     No
Oliver   Yes
Martha   Yes
Lucas    No
Caroline Yes

In [7]:
df_new = cbind(df, df2)
df_new

         Age Height Weight Sex working
Alex     25  177    57     F   Yes
Lilly    31  163    69     F   No
Mark     23  190    83     M   No
Oliver   52  179    75     M   Yes
Martha   76  163    70     F   Yes
Lucas    49  183    83     M   No
Caroline 26  164    53     F   Yes

In [8]:
dim(df_new)

[1] 7 5

In [9]:
str(df_new)

'data.frame':	7 obs. of  5 variables:
 $ Age    : num  25 31 23 52 76 49 26
 $ Height : num  177 163 190 179 163 183 164
 $ Weight : num  57 69 83 75 70 83 53
 $ Sex    : Factor w/ 2 levels "F","M": 1 1 2 2 1 2 1
 $ working: Factor w/ 2 levels "No","Yes": 2 1 1 2 2 1 2